# text = "Написать свой текст"
# print(text[0])
# print(text[6])
#
# # Проверить что будет если мы выведем 6 индекс
#
#
# text = "Написать свой текст"
# print(text[-1])
# print(text[-6])
#
# # Проверить что будет если мы выведем -6 индекс

'''* Задание №1:
    1. Сделай несколько переменных с различными типами данных (например int, float, bool)
    2. Выведи результат
* Задание №2:
    1. Сделай переменную типа str
    2. Попробуй вывести на экран тип переменной, передав внутрь функции print() функцию type() с аргументом в виде переменной'''

# x = 2
# y = 2.5
# z = True
# print(x, y, z)
#
# x = 'x'
# print(type(x))