'''Задания:
* Работа с числами. Создайте переменную a со значением 10. Создайте ещё одну переменную b, присвоив ей результат a + 5.
Проверьте, изменилось ли значение переменной a.
* Кортежи: Создайте кортеж с именем colors, содержащий три цвета.
Попробуйте изменить один из элементов кортежа. Что произойдёт?
* Строки: Создайте строку text со значением "Python". Добавьте к ней " Rocks!".
Проверьте, изменилась ли исходная строка.
* Хэшируемость: Создайте словарь с ключами типа int, float, str, и tuple.
Попробуйте использовать в качестве ключа список. Объясните, почему это вызывает ошибку.
'''

# a = 10
# b = a + 5
# print(a)
# print(b)

# colors = ('red', 'green', 'blue')
# colors[0] = 'brown' #ошибка брат
# print(colors, type(colors), len(colors))

# text = 'Python'
# text = text + ' Rocks!'
# print(text)

# x = {'int':'1', 'float':'2', 'str':'3', 'tuple':'4'}
# x = {'1':'1', '1.5':'2', 'one':'3', '(1, 2, 3)':'4'}
# print(x)
# x = {'1':'1', '1.5':'2', 'one':'3', '(1, 2, 3)':'4', [1, 2, 3]:'5'}