'''- **Задание #1**
    1. Создайте переменную `username` и присвойте ей значение `None`.
    2. Проверьте, равна ли переменная `username` значению `None`. Если да, присвойте ей значение `"Гость"`.
    3. Выведите результат переменной `username`.
- **Задание #2**
    1. Напишите функцию `greet_user`, которая принимает один параметр — `name`.
    2. Внутри функции проверьте, если `name` равно `None`, установите его значение на `"Аноним"`.
    3. Функция должна выводить `Привет, {name}!`. Протестируйте функцию, вызывая её с `None` и с именем.
- **Задание #3**
    1. Создайте словарь `user_info`, где ключи — это `name`, `age`, и `email`, и значение для `email` установите как `None`.
    2. Напишите проверку, которая устанавливает значение `email` на `"не указан"`, если оно равно `None`.
    3. Выведите обновлённый словарь.'''

# username = None
# if username is None:
#     username = 'Гость'
#     print(username)
# else:
#     print(username)

# name = None
#
# def greet_user(name):
#     if name is None:
#         name = 'Anon'
#         print(f'Привет, {name}!')
#     else:
#         print(f'Привет, {name}!')
#
# # name = input('Введи имя: ')
# greet_user(name)

# user_info = {
#     'name': 'Marat',
#     'age': 123,
#     'email': None
# }
#
# if user_info.get('email') is None:
#     user_info.update({'email': 'Не указан'})
#     print(user_info)
# else:
#     print(user_info)


