'''### **Задание #1**

1. Создайте переменные `age1` и `age2` со значениями возраста двух людей.
2. Проверьте, равны ли значения `age1` и `age2` с помощью оператора `==` и `assert`.
3. Выведите результат проверки.

### **Задание #2**

1. Создайте две переменные `password1` и `password2` с разными строковыми значениями пароля.
2. Проверьте, совпадают ли значения `password1` и `password2`, используя`assert` и `==`.
3. Выведите результат проверки на экран.

### **Задание #3**

1. Попробуйте сравнить `1` и `True` - Выведите результат при помощи `print()`'''

# age1 = 10
# age2 = 45
# print(age1 == age2)
# assert age1 == age2, 'age1 != age2'

# password1 = 'asdfgh'
# password2 = 'qwerty'
# print(password1 == password2)
# assert password1 == password2, 'pass1 != pass2'

# print(1 == True)

