'''### **Задание #1**

1. Создайте две переменные `age_person1` и `age_person2` с разными значениями возрастов.
2. Проверьте, является ли `age_person1` больше, чем `age_person2`, используя оператор `>`.
3. Выведите результат проверки.

### **Задание #2**

1. Создайте переменные `height1` и `height2` для хранения роста двух человек (в сантиметрах).
2. Проверьте, меньше ли `height1`, чем `height2`, используя оператор `<`.
3. Выведите результат проверки.

### **Задание #3**

1. Создайте переменную `temperature` со значением текущей температуры на улице и переменную `freezing_point` со значением 0.
2. Используйте оператор `>=`, чтобы проверить, выше или равна ли `temperature` точке замерзания (`freezing_point`).
3. Выведите результат проверки, чтобы определить, является ли температура на улице выше или ниже точки замерзания.

### **Задание #4**

1. Запиши в переменную целое число, которое больше 1. (например 2 или 3)
2. Попробуй сравнить, больше ли эта переменная, чем True?
3. Результат выведи при помощи `print()`'''

# age_person1 = 21
# age_person2 = 48
# print(age_person1 > age_person2)

# height1 = 178
# height2 = 265
# print(height1 < height2)

# temperature = 25
# freezing_point = 0
# print(temperature >= freezing_point)

# x = 3
# print(x > True)