# user = {"name": "John", "age": 30, "city": "New York"}
# for key, value in user.items():  # Аналог foreach для словаря
#     print(key, "->", value)

# command = "start"
#
# if command == "start":
#     print("Starting the system...")
# elif command == "stop":
#     print("Stopping the system...")
# elif command == "restart":
#     print("Restarting the system...")
# else:
#     print("Unknown command")

'''1. Напишите цикл `for`, который проходит по списку чисел `[10, 20, 30]` и выводит их квадраты.
2. Используйте `if-elif-else` для проверки переменной `day`, чтобы вывести:
    - "Понедельник", если значение равно `1`.
    - "Вторник", если значение равно `2`.
    - "Выходной", если значение равно `6` или `7`.'''

# my_list = [10, 20, 30]
# for i in my_list:
#     print(i**2)

# day = 5
# if day == 1:
#     print('Понедельник')
# elif day == 2:
#     print('Вторник')
# elif day == 6:
#     print('Выходной')
# elif day == 7:
#     print('Выходной')
# else:
#     print('День недели не поддерживается')
