'''1. Вывести числа от 1 до 10 используя while
2. сделать переменную n. написать программу, которая выведет сумму всех чисел от 1 до n с помощью `while`
3. Дан список `nums = [2, 7, 4, 9, 6, 5]`. Используя `while`, удалить все чётные числа из этого списка'''

# n = 1
# while n < 11:
#     print(n)
#     n += 1
# print('цикл окончен')

# n = 5
# i = 1
# x = 0
# while i <= n:
#     x +=i
#     i +=1
# print(x)

# nums = [2, 7, 4, 9, 6, 5]
# # print(len(nums))
# i = 0
# while i < len(nums):
#     if nums[i] % 2 == 0:
#         del nums[i]
#     else:
#         i +=1
# print(nums)

