'''* Задание#7 Создайте переменную sentence со значением "Кот сидит на крыше.".
    1. Замените подстроку "Кот" на "Пёс" и сохраните результат в переменную new_sentence. Проверьте результат.
    2. Замените "крыше" на "дереве" и сохраните результат в переменную new_sentence2. Проверьте результат.
* Задание#7.1 Создайте переменную phrase со значением "Я люблю яблоки и яблоки - самые вкусные фрукты.".
    1. Используйте метод replace(), чтобы заменить только первое вхождение "яблоки" на "бананы".
(Подсказка: используйте дополнительный аргумент в replace() для ограничения числа замен.)
    2. Замените все вхождения "яблоки" на "бананы" и сохраните результат в new_phrase. Проверьте результат.
* Задание#7.2 Создайте переменную text со значением "Привет, мир! Привет, люди! Привет, солнце!".
    1. Замените подстроку "Привет" на "Здравствуй" во всех вхождениях.
    2. Попробуйте заменить "люди" на "друзья" и сохраните результат в переменную greeting. Проверьте результат.
'''

# sentence = "Кот сидит на крыше."
# new_sentence = sentence.replace('Кот', 'Пес')
# print(new_sentence)
# new_sentence = new_sentence.replace('крыше', 'дереве')
# print(new_sentence)

# phrase = "Я люблю яблоки и яблоки - самые вкусные фрукты."
# print(phrase.replace('яблоки', 'бананы', 1))
# print(phrase.replace('яблоки', 'бананы'))

# text = "Привет, мир! Привет, люди! Привет, солнце!"
# new_text = text.replace('Привет', 'Здравствуй')
# print(new_text)
# new_text = new_text.replace('люди', 'друзья')
# print(new_text)


