'''### **Задание #1**

1. Создайте переменные `number1` и `number2` с различными числовыми значениями.
2. Проверьте, не равны ли значения `number1` и `number2`, используя `assert` и оператор `!=`
3. Выведите результат проверки

### **Задание #2**

1. Сделай переменную с числовым значением > 0
2. В `print()` передай в качестве аргумента выражение, где переменная будет сравниваться с `False` путем оператора `!=`'''

# num1 = 51
# num2 = 48
# print(num1 != num2)
# assert num1 != num2, 'num1 = num2'

# x = 10
# print(x != False)