'''1. Сделать словарь, в котором будет содержаться, пусть будет, меню ресторана
А именно: название блюда и его цена
Цены придумай самостоятельно (пусть варьируются от 100 до 1000)
Пополни словарь новым ключ-значением: Карпачо - 1500
Выведи список на экран
Замени стоимость “Карпачо” на 1100 Снова выведи список на экран
2. Дан словарь products = {"яблоко": 100, "банан": 50, "апельсин": 70}
Завести переменную order , которая будет содержать в себе “яблоко”
Написать конструкцию, которая будет проверять, есть ли order в словаре, и если есть, то выводить стоимость.
Если order нет в словаре, то выводить “у нас нет такого товара”
Выполнить программу в 2 случаях:
    1. order = "яблоко"
    2. order = “черви”
'''

# menu = {'plov':600, 'samsa':400, 'lula':800, 'hinkal':700, 'lobio':500, 'hinkali':150, 'salad':600}
# print(menu)
# menu['Карпачо'] = 1500
# print(menu)
# menu['Карпачо'] = 1100
# print(menu)

# products = {"яблоко": 100, "банан": 50, "апельсин": 70}
# order = 'яблоко'
# if order in products:
#     print(order, '\t', products[order])
# else:
#     print(f'У нас нет товара {order}')


