'''
1. Вывести квадрат чисел от 1 до 5 используя for и range
2. сделать переменную n. написать программу, которая выведет сумму всех чисел от 1 до n
3. Вывести числа от 10 до 1 в обратном порядке используя цикл for
4. Дан список fruits = ["яблоко", "банан", "груша"]
Нужно вывести каждый элемент этого списка на отдельной строке
5. Поиск максимального элемента в списке Дано numbers = [3, 8, 1, 9, 4].
Используя for, найти максимальное число
6. Дан словарь products = {"яблоко": 100, "банан": 50, "апельсин": 70} Вывести на экр сумму всех цен'''

# for i in range(1,6):
#     print(i**2)

# n = 5
# result = 0
# for i in range(1,n+1):
#     result = result+i
# print(result)

# for i in range(10,0, -1):
#     print(i)

# fruits = ["яблоко", "банан", "груша"]
# for i in fruits:
#     print(i)

# numbers = [3, 8, 1, 9, 4]
# max_number = 0
# # print(max(numbers))
# for i in numbers:
#     if i > max_number:
#         max_number = i
# print(max_number)

# products = {"яблоко": 100, "банан": 50, "апельсин": 70}
# total = 0
# for a,b in products.items():
#     total += b
# print(total)
