'''- **Задание #1**
    - Создайте переменную `value` со значением `3.14159`.
    - Используйте функцию `round()` для округления `value` до двух знаков после запятой и сохраните результат в переменную `rounded_value`.
    - Выведите `rounded_value` на экран.
- **Задание #2**
    - Создайте переменную `price` со значением `19.999`.
    - Используйте функцию `round()` для округления `price` до целого числа и сохраните результат в переменную `rounded_price`.
    - Выведите `rounded_price` на экран.
- **Задание #3**
    - Создайте список вещественных чисел `grades = [89.9, 92.75, 88.6, 91.3]`.
    - Используйте цикл, чтобы пройтись по каждому числу в списке и округлить его до одного знака после запятой.
    - Сохраните результаты округления в новый список `rounded_grades` и выведите его на экран.'''

# alue = 3.14159
# rounded_value = round(alue, 2)
# print(rounded_value)
#
# price = 19.999
# rounded_price = round(price)
# print(rounded_price)

# grades = [89.9, 92.75, 88.6, 91.3]
# for num in grades:
#     number = round(num)
#     print(number)

# grades = [89.9, 92.75, 88.6, 91.3]
# for i in grades:
#     print(round(i))
