'''- **Задание #1**
    1. Создайте переменную `employee` и присвойте ей значение `None`.
    2. Используйте условный оператор `if` для проверки, и если `employee` не равен `None`, выведите атрибут `employee.name`.
    3. В противном случае выведите сообщение `"Сотрудник не найден"`.
- **Задание #2**
    1. Создайте переменную `car` и присвойте ей значение `None`.
    2. Проверьте, и если `car` не равен `None`, выведите значение атрибута `car.model`.
    3. Если `car` равен `None`, выведите сообщение `"Автомобиль не указан"`.
- **Задание #3**
    1. Создайте переменную `book` и присвойте ей значение `None`.
    2. Проверьте, если `book` инициализирован, выведите `book.title`. Если нет — выведите сообщение `"Книга не найдена"`.'''


# employee = None
# if employee is not None:
#     print(employee.name)
# else:
#     print("Сотрудник не найден")




