''' FOR

1. **Итерация по списку:**
Напишите цикл, который выводит все элементы списка чисел `[10, 20, 30, 40, 50]`.
2. **Итерация по строке:**
Напишите цикл, который выводит каждый символ строки `"Hello, Python!"`.
3. **Работа со словарём:**
Создайте словарь с именами друзей и их возрастами. Напишите цикл, который выводит имя друга и его возраст.'''

# numbers = [10, 20, 30, 40, 50]
# for number in numbers:
#     print(number)

# str = "Hello, Python!"
# for i in str:
#     print(i)

# my_dict = {'friend1':21, 'frind2':45, 'friend3':'3'}
# for friend, age in my_dict.items():
#     print(f'friend:{friend}, age:{age}')

''' WHILE
* Обратный отсчёт: Создайте программу, которая выводит числа от 10 до 1 с шагом -1. 
После завершения цикла выведите сообщение "Цикл завершён!".
* Проверка пароля: Напишите цикл, который запрашивает у пользователя пароль, пока он не введёт правильный пароль "12345". 
После правильного ввода выведите "Доступ разрешён".
* Вывод нечётных чисел: Создайте программу, которая выводит все нечётные числа от 1 до 10, используя цикл while.
'''

# num = 10
# while num >=1:
#     print(num)
#     num -= 1
# print("Цикл завершен")

# password = ""
# while password != 12345:
#     password = int(input("Введи пароль: "))
# print("Доступ разрешён")

# num = 1
# while num <= 10:
#     if num%2 != 0:
#         print(num)
#     num += 1



