# my_dict = {'pers1':'name1', 'pers2':'name2', 'pers3':'name3', 'pers4':'name4', 'pers5':'name5'}
# for pers, name in my_dict.items():
#     print(f'{pers}\t{name}')

# print('name\tmaj\t\tsal')
# print('pers1\tmajor1\t10 000')
# print('pers2\tmajor2\t20 000')
# print('pers3\tmajor3\t30 000')

# my_dict = {'apple':50, 'banan':40, 'pineapple':350, 'pear':60, 'orange':35}
# print(f'fruit\tcoste')
# for fruit, coste in my_dict.items():
#     print(f'{fruit}\t{coste}')

# # Внешний цикл по числам от 1 до 10
# for i in range(1, 11):
#     # Вложенный цикл для умножения каждого числа на числа от 1 до 10
#     for j in range(1, 11):
#         print(f"{i} * {j} = {i * j}", end="\t")  # Результаты отображаются в строку
#     print()  # Переход на новую строку после внутреннего цикла

'''Напишите программу, которая выводит таблицу сложения для чисел от 1 до 5.
Измените таблицу умножения, чтобы результаты выводились в красивой форме с разделением, например:
'''

# for i in range(1,6):
#     for j in range(1,6):
#         print(f'{i} + {j} = {i + j}', end="\t")
#     print()

# for i in range(1,6):
#     for j in range(1,6):
#         print(f'{i + j}', end="\t")
#     print()