'''- **Задание #1**
    1. Создайте переменную `distance_to_sun` и присвойте ей значение `1.496e11` (расстояние до Солнца в метрах).
    2. Создайте переменную `mass_of_proton` и присвойте ей значение `1.67e-27` (масса протона в килограммах).
    3. Выведите оба значения и объясните, почему экспоненциальная форма записи удобна для таких величин.
- **Задание #2**
    1. Создайте переменную `large_value` со значением `3.6e5`.
    2. Создайте переменную `small_value` со значением `4.2e-3`.
    3. Умножьте `large_value` на `small_value` и выведите результат.
Объясните, почему Python использует экспоненциальную запись для представления результата.
- **Задание #3**
    1. Напишите программу, которая принимает число от пользователя в экспоненциальной форме.
    Используйте `float(input("Введите число в экспоненциальной форме: "))` для получения значения.
    2. Выведите полученное число в обычной форме.
    3. Объясните, почему результат может отличаться от введённого значения, если оно очень маленькое или очень большое.'''

# distance_to_sun = 1.496e11
# mass_of_proton = 1.67e-27
# print(distance_to_sun)
# print(mass_of_proton)

# large_value = 3.6e5
# small_value = 4.2e-3
# print(large_value)
# print(small_value)
# print(large_value * small_value)

# number = float(input("Введите число в экспоненциальной форме: "))
# print(number)
