'''1. Создать список с 5 числами (например 1, 2, 3, 4, 5)
Вывести в терминал сумму этих чисел
2. Дан список nums = [3, 4, 11, 4, 4]. Надо заменить третий элемент на 100 и вывести обновленный список
3. Сделать пустой список
Пополнить список из диапазона чисел от 1 до 100 с шагом в 3
Вывести этот список на экран'''

# my_list = [1,2,3,4,5]
# print(sum(my_list))

# nums = [3, 4, 11, 4, 4]
# print(nums)
# nums[2] = 100
# print(nums)

# x = []
# for i in range(1,100):
#     if i%3 != 0:
#         continue
#     # print(i)
#     x.append(i)
# print(x)
