'''### **Задание #1**

- Создайте переменные `x = 25` и `y = 4`.
- Используйте оператор `//`, чтобы найти целую часть от деления `x` на `y`, и сохраните результат в переменную `quotient`.
- Найдите остаток от деления `x` на `y` с помощью `%`, и сохраните результат в переменную `remainder`.
- Выведите `quotient` и `remainder` на экран.

### **Задание #2**

- Создайте переменную `total_seconds` со значением `7853`.
- Используя оператор `//`, найдите, сколько полных минут содержится в `total_seconds`, и сохраните результат в переменную `minutes`.
- С помощью `%`, найдите, сколько секунд остаётся после вычитания минут, и сохраните результат в переменную `seconds`.
- Выведите `minutes` и `seconds` на экран.

### **Задание #3**

- Создайте переменные `a = 47` и `b = 5`.
- Используя `//`, определите, сколько раз число `b` полностью помещается в число `a`, и сохраните результат в переменную `div_count`.
- Найдите остаток от деления `a` на `b` и сохраните его в переменную `leftover`.
- Выведите `div_count` и `leftover` на экран.'''

# x = 25
# y = 4
# quotient = x // y
# print(quotient)
# remainder = x % y
# print(remainder)

# total_seconds = 7853
# minutes = total_seconds // 60
# print(minutes)
# seconds = total_seconds % 60
# print(seconds)
# print(f'в total_seconds {minutes} минут {seconds} секунд')

# a = 47
# b = 5
# div_count = a // b
# leftover = a % b
# print(div_count)
# print(leftover)