'''### Задание #1

Создайте переменную `float_num` со значением `12.99`.

1. Примените к `float_num` функцию `int()` и сохраните результат в переменную `int_num`. Проверьте результат, выведя его на экран.
2. Обратите внимание, как дробная часть числа обрабатывается функцией `int()`.

### Задание #2

Создайте переменную `string_num` со значением `"45"` (строковый тип).

1. Преобразуйте `string_num` в целое число, используя функцию `int()`, и сохраните результат в переменную `converted_num`.
2. Проверьте тип переменной `converted_num`, чтобы убедиться, что она теперь целочисленного типа.

### Задание #3

Создайте переменную `invalid_string` со значением `"hello123"`.

1. Попробуйте преобразовать `invalid_string` в целое число с помощью функции `int()`.
2. Обратите внимание на возникшую ошибку и подумайте, почему Python не может преобразовать это значение в целое число.'''

# float_num = 12.99
# int_num = int(float_num)
# print(int_num)

# string_num = '45'
# print(type(string_num))
# converted_num = int(string_num)
# print(converted_num)
# print(type(converted_num))

# invalid_string = "hello123"
# converted_num = int(invalid_string)
# print(converted_num)
