# for num in range(1, 10):
#     if num == 5:
#         break  # Завершение цикла
#     print(num)

# for num in range(1, 10):
#     if num == 5:
#         continue  # Пропуск числа 5
#     print(num)

'''1. Напишите программу, которая находит первое число больше 50 в списке и завершает цикл (`break`).
2. Создайте цикл, который пропускает все числа, кратные 3, из диапазона от 1 до 20 (`continue`).'''

# my_list = [1,5,6,19,53,46,92]
# for i in my_list:
#     if i >= 50:
#         break
#     print(f'number == {i}, index:, {my_list.index(i)}')

# for i in range(1,20):
#     if i%3 == 0:
#         continue
#     print(i)