# Задания 4 на тему "Циклы в Python"


'''**Вывод чисел от 1 до 10**

Напишите программу, которая использует цикл `for`, чтобы вывести числа от 1 до 10.'''

# for i in range(1,11):
#     print(i)

'''**Обратный отсчёт**

Напишите программу, которая использует цикл `while` для вывода чисел от 10 до 1, а затем выводит сообщение `"Счёт завершён!"`.'''

# for i in range(10,0,-1):
#     print(i)

# n = 10
# while n >= 1:
#     print(n)
#     n -= 1
# print('The end')

'''**Таблица умножения на 5**

Напишите программу, которая выводит таблицу умножения на 5 с использованием вложенного цикла.'''

# for i in range(1,6):
#     for n in range(1,6):
#         print(f'{i}*{n}={i*n}', end='\t')
#     print()


# for i in range(1, 11):
#     result = 5 * i
#     print(f"5 x {i} = {result}")
