'''Сделай диапазоны, где:

1. начинается с `2` и заканчивается перед `6`
2. числа увеличиваются на `2` на каждом шаге
3. идёт в обратном порядке, уменьшая значение на `2` на каждом шаге
то есть с отрицательным шагом
4. где `start` диапазона > **`stop`** - попробуй преобразовать его в список и ознакомься с результатом'''

# r = range(2, 6)
# print(r)
# print(list(r))

# r = range(2, 6, 2)
# print(r)
# print(list(r))

# r = range(6, 1, -2)
# print(r)
# print(list(r))

# r = range(6, 1)
# print(r)
# print(list(r))

# print(len(range(5, 15, 2)))
# print(list(range(5, 15, 2)))