'''### **Задание #1**

- Создайте переменную `num1` со значением `789`.
- Преобразуйте `num1` в строку и используйте `len()` для подсчёта количества цифр.
- Сохраните результат в переменную `num_length` и выведите её на экран.

### **Задание #2**

- Создайте переменную `large_number` со значением `1234567890123`.
- Преобразуйте `large_number` в строку и используйте `len()` для определения количества цифр.
- Выведите результат на экран.

### **Задание #3**

- Создайте переменную `phone_number` со значением `84951234567`.
- Используйте `len()` для подсчёта количества цифр в номере телефона, преобразовав его в строку.
- Проверьте, что длина равна `11`. Выведите результат.'''

# num1 = 'abc'
# num_length = len(num1)
# print((num_length))

# num1 = 7890
# num_length = len(str(num1))
# print((num_length))

# large_number = 1234567890123
# print(len(str(large_number)))

# phone_number = 84951234567
# print(len(str(phone_number)))
