'''* Задание №1:
дан код: number = 5
*
* if number > 0:
*     print("Число положительное")  # Число положительное
*
* print("продолжаю работу")
*
    1. Запусти код, в терминале выполнения ты увидишь результат обоих принтов
    2. Попробуй изменить выражение, чтобы оно получилось False и запусти проанализируй результат
    3. Попробуй вместо выражения number > 0 передать просто True и затем False Проанализируй результат работы программы

* Задание №2:
Дан массив чисел numbers = [1, 2, 3, 4, 5]
    1. Попробуй узнать индекс элемента 10 - получи ошибку
    2. Используй конструкцию if, чтобы не получить ошибку
'''

# number = 1
#
# if number > True:
#     print("Число положительное")  # Число положительное
#
# print("продолжаю работу")

numbers = [1, 2, 3, 4, 5]
# print(numbers[3])
# print(numbers.index(3))
# print(numbers)

# element = 5
# if element in numbers:
#     index = numbers.index(element)
#     print(f"Индекс элемента {element}: {index}")
# else:
#     print(f"Элемент {element} отсутствует в списке, поэтому индекс получить нельзя")