'''* Задание№1
    1. Напишите программу, где будет 2 переменные с числом, а программа выводит сообщение, какое из чисел наибольшее
    2. Учти, что числа так же могут быть равны друг другу - такой случай тоже надо обработать

Задание№2: Дан список зарегистрированных логинов: used_logins = ["user123", "hacker", "test_bot"]
    1. Сделать переменную new_login, которая будет содержать в себе "user123"
    2. Написать if-else логику, которая будет проверять, есть ли уже такой логин В логике проверки использовать оператор in
    3. Выводить в виде текста использовался ли логин или нет
    4. изменить переменную new_login чтобы логин не совпадал с теми, что есть в used_logins
    5. Прогнать программу заново
'''

# num1 = 10
# num2 = 10
# if num1 > num2:
#     print(f'{num1} > {num2}')
# elif num1 < num2:
#     print(f'{num1} < {num2}')
# else:
#     print(f'{num1} == {num2}')

# used_logins = ["user123", "hacker", "test_bot"]
# new_login = "user123"
# if new_login in used_logins:
#     print(f'{new_login} used in used_logins')
# else:
#     print(f'{new_login} not used in used_logins')



