'''### **Задание #1**

Создайте переменную `num1` со значением `-56`.

1. Примените функцию `abs()` к `num1`, чтобы получить его абсолютное значение. Сохраните результат в переменную `abs_num1`.
2. Выведите `abs_num1` на экран.

### **Задание #2**

Создайте переменную `num2` со значением `-4.8`.

1. Примените функцию `abs()` к `num2` и сохраните результат в переменную `abs_num2`.
2. Проверьте результат, выведя `abs_num2` на экран, и убедитесь, что значение положительное.'''

# num1 = -56
# abs_num1 = abs(num1)
# print(abs_num1)
#
# num2 = -4.8
# abs_num2 = abs(num2)
# print(abs_num2)